Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك ولتكونن من الخاسرين
en: And indeed it has been revealed to you (O Muhammad صلى الله عليه وسلم), as it was to those (Allah's Messengers) before you: "If you join others in worship with Allah, (then) surely (all) your deeds will be in vain, and you will certainly be among the losers."

source: بل الله فاعبد وكن من الشاكرين
en: Nay! But worship Allah (Alone and none else), and be among the grateful.

source: وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسماوات مطويات بيمينه سبحانه وتعالى عما يشركون
en: They made not a just estimate of Allah such as is due to Him. And on the Day of Resurrection the whole of the earth will be grasped by His Hand and the heavens will be rolled up in His Right Hand.Glorified be He, and High be He above all that they associate as partners with Him!

source: ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ثم نفخ فيه أخرى فإذا هم قيام ينظرون
en: And the Trumpet will be blown, and all who are in the heavens and all who are on the earth will swoon away, except him whom Allah wills. Then it will be blown a second time, and behold they will be standing, looking on (waiting).

source: وأشرقت الأرض بنور ربها ووضع الكتاب وجيء بالنبيين والشهداء وقضي بينهم بالحق وهم لا يظلمون
en: And the earth will shine with the light of its Lord (Allah, when He will come to judge among men): and the Book will be placed (open); and the Prophets and the witnesses will be brought forward; and it will be judged between them with truth, and they will not be wronged.

source: ووفيت كل نفس ما عملت وهو أعلم بما يفعلون
en: And each person will be paid in full of what he did; and He is Best Aware of what they do.

source: وسيق الذين كفروا إلى جهنم زمرا حتى إذا جاءوها فتحت أبوابها وقال لهم خزنتها ألم يأتكم رسل منكم يتلون عليكم آيات ربكم وينذرونكم لقاء يومكم هذا قالوا بلى ولكن حقت كلمة العذاب على الكافرين
en: And those who disbelieved will be driven to Hell in groups till, when they reach it, the gates thereof will be opened (suddenly like a prison at the arrival of the prisoners). And its keepers will say, "Did not the Messengers come to you from yourselves, reciting to you the Verses of your Lord, and warning you of the Meeting of this Day of yours?" They will say: "Yes, but the Word of torment has been justified against the disbelievers!"

source: قيل ادخلوا أبواب جهنم خالدين فيها فبئس مثوى المتكبرين
en: It will be said (to them): "Enter you the gates of Hell, to abide therein. And (indeed) what an evil abode of the arrogant!"

source: وسيق الذين اتقوا ربهم إلى الجنة زمرا حتى إذا جاءوها وفتحت أبوابها وقال لهم خزنتها سلام عليكم طبتم فادخلوها خالدين
en: And those who kept their duty to their Lord (Al-Muttaqun ) will be led to Paradise in groups, till, when they reach it, and its gates will be opened (before their arrival for their reception) and its keepers will say: Salamun 'Alaikum (peace be upon you)! You have done well, so enter here to abide therein."

source: وقالوا الحمد لله الذي صدقنا وعده وأورثنا الأرض نتبوأ من الجنة حيث نشاء فنعم أجر العاملين
en: And they will say: "All the praises and thanks be to Allah Who has fulfilled His Promise to us and has made us inherit (this) land. We can dwell in Paradise where we will; how excellent a reward for the (pious, good) workers!"

source: وترى الملائكة حافين من حول العرش يسبحون بحمد ربهم وقضي بينهم بالحق وقيل الحمد لله رب العالمين
en: And you will see the angels surrounding the Throne (of Allah) from all round, glorifying the praises of their Lord (Allah). And they (all the creatures) will be judged with truth. And it will be said, "All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinn and all that exists)."

source: حم
en: Ha-Mim. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings].

source: تنزيل الكتاب من الله العزيز العليم
en: The revelation of the Book (this Qur'an) is from Allah, the All-Mighty, the All-Knower.

source: غافر الذنب وقابل التوب شديد العقاب ذي الطول لا إله إلا هو إليه المصير
en: The Forgiver of sin, the Acceptor of repentance, the Severe in punishment, the Bestower (of favours). La ilaha illa Huwa (none has the right to be worshipped but He), to Him is the final return.

source: ما يجادل في آيات الله إلا الذين كفروا فلا يغررك تقلبهم في البلاد
en: None disputes in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you [O Muhammad صلى الله عليه وسلم, for their ultimate end will be the Fire of Hell]!

source: كذبت قبلهم قوم نوح والأحزاب من بعدهم وهمت كل أمة برسولهم ليأخذوه وجادلوا بالباطل ليدحضوا به الحق فأخذتهم فكيف كان عقاب
en: The people of Nuh (Noah) and the Confederates after them denied (their Messengers) before these; and every (disbelieving) nation plotted against their Messenger to seize him, and disputed by means of falsehood to refute therewith the truth. So I seized them (with punishment), and how (terrible) was My punishment!

source: وكذلك حقت كلمت ربك على الذين كفروا أنهم أصحاب النار
en: Thus has the Word of your Lord been justified against those who disbelieved, that they will be the dwellers of the Fire.

source: الذين يحملون العرش ومن حوله يسبحون بحمد ربهم ويؤمنون به ويستغفرون للذين آمنوا ربنا وسعت كل شيء رحمة وعلما فاغفر للذين تابوا واتبعوا سبيلك وقهم عذاب الجحيم
en: Those (angels) who bear the Throne (of Allah) and those around it glorify the praises of their Lord, and believe in Him, and ask forgiveness for those who believe (in the Oneness of Allah) (saying): "Our Lord! You comprehend all things in mercy and knowledge, so forgive those who repent and follow Your Way, and save them from the torment of the blazing Fire!

source: ربنا وأدخلهم جنات عدن التي وعدتهم ومن صلح من آبائهم وأزواجهم وذرياتهم إنك أنت العزيز الحكيم
en: "Our Lord! And make them enter the 'Adn (Eden) Paradise (everlasting Gardens) which you have promised them - and to the righteous among their fathers, their wives, and their offspring! Verily, You are the All-Mighty, the All-Wise.

source: وقهم السيئات ومن تق السيئات يومئذ فقد رحمته وذلك هو الفوز العظيم
en: "And save them from (the punishment, for what they did of) the sins, and whomsoever You save from (the punishment for what he did of) the sins (i.e. pardon him) that Day, him verily, You have taken into mercy." And that is the supreme success.

source: إن الذين كفروا ينادون لمقت الله أكبر من مقتكم أنفسكم إذ تدعون إلى الإيمان فتكفرون
en: Those who disbelieve will be addressed (at the time of entering the Fire): "Allah's aversion was greater towards you (in the worldly life when you used to reject the Faith) than your aversion towards one another (now in the Fire of Hell, as you are now enemies to one another), when you were called to the Faith but you used to refuse."

source: قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين فاعترفنا بذنوبنا فهل إلى خروج من سبيل
en: They will say: "Our Lord! You have made us to die twice (i.e. we were dead in the loins of our fathers and dead after our life in this world), and You have given us life twice (i.e. life when we were born and life when we are Resurrected)! Now we confess our sins, then is there any way to get out (of the Fire)?" (Tafsir Al-Qurtubi,)

source: ذلكم بأنه إذا دعي الله وحده كفرتم وإن يشرك به تؤمنوا فالحكم لله العلي الكبير
en: (It will be said): "This is because, when Allah Alone was invoked (in worship) you disbelieved (denied), but when partners were joined to Him, you believed! So the judgement is only with Allah, the Most High, the Most Great! "

source: هو الذي يريكم آياته وينزل لكم من السماء رزقا وما يتذكر إلا من ينيب
en: It is He Who shows you His Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and sends down (rain with which grows) provision for you from the sky. And none remembers but those who turn (to Allah in obedience and) in repentance (by begging His Pardon and by worshipping and obeying Him Alone and none else).

source: فادعوا الله مخلصين له الدين ولو كره الكافرون
en: So, call you (O Muhammad صلى الله عليه وسلم and the believers) upon (or invoke) Allah making (your) worship pure for Him (Alone) (by worshipping none but Him and by doing religious deeds sincerely for Allah's sake only and not to show off and not to set up rivals with Him in worship), however much the disbelievers (in the Oneness of Allah) may hate (it).

source: رفيع الدرجات ذو العرش يلقي الروح من أمره على من يشاء من عباده لينذر يوم التلاق
en: (He is Allah) Owner of High Ranks and Degrees, the Owner of the Throne. He sends the revelation by His Command to any of His slaves He wills, that he (the person who receives revelation) may warn (men) of the Day of Mutual Meeting (i.e. the Day of Resurrection).

source: يوم هم بارزون لا يخفى على الله منهم شيء لمن الملك اليوم لله الواحد القهار
en: The Day when they will (all) come out, nothing of them will be hidden from Allah. Whose is the kingdom this Day? (Allah Himself will reply to His Question): It is Allah's the One, the Irresistible!

source: اليوم تجزى كل نفس بما كسبت لا ظلم اليوم إن الله سريع الحساب
en: This Day shall every person be recompensed for what he earned. This Day no injustice (shall be done to anybody). Truly, Allah is Swift in reckoning.

source: وأنذرهم يوم الآزفة إذ القلوب لدى الحناجر كاظمين ما للظالمين من حميم ولا شفيع يطاع
en: And warn them (O Muhammad صلى الله عليه وسلم) of the Day that is drawing near (i.e. the Day of Resurrection), when the hearts will be choking the throats, and they can neither return them (hearts) to their chests nor can they throw them out. There will be no friend, nor an intercessor for the Zalimun (polytheists and wrong-doers), who could be given heed to.

source: يعلم خائنة الأعين وما تخفي الصدور
en: Allah knows the fraud of the eyes, and all that the breasts conceal.

source: والله يقضي بالحق والذين يدعون من دونه لا يقضون بشيء إن الله هو السميع البصير
en: And Allah judges with truth, while those to whom they invoke besides Him, cannot judge anything. Certainly, Allah! He is the All-Hearer, the All-Seer.

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين كانوا من قبلهم كانوا هم أشد منهم قوة وآثارا في الأرض فأخذهم الله بذنوبهم وما كان لهم من الله من واق
en: Have they not travelled in the land and seen what was the end of those who were before them? They were superior to them in strength, and in the traces (which they left) in the land. But Allah seized them with punishment for their sins. And none had they to protect them from Allah.

source: ذلك بأنهم كانت تأتيهم رسلهم بالبينات فكفروا فأخذهم الله إنه قوي شديد العقاب
en: That was because there came to them their Messengers with clear evidence (proofs and signs) but they disbelieved (in them). So Allah seized them (with punishment). Verily He is All-Strong, Severe in punishment.

source: إلى فرعون وهامان وقارون فقالوا ساحر كذاب
en: To Fir'aun (Pharaoh), Haman and Qarun (Korah), but they called (him): "A sorcerer, a liar!"

source: فلما جاءهم بالحق من عندنا قالوا اقتلوا أبناء الذين آمنوا معه واستحيوا نساءهم وما كيد الكافرين إلا في ضلال
en: Then, when he brought them the Truth from Us, they said: "Kill the sons of those who believe with him and let their women live"; but the plots of disbelievers are nothing but in vain!

source: وقال فرعون ذروني أقتل موسى وليدع ربه إني أخاف أن يبدل دينكم أو أن يظهر في الأرض الفساد
en: Fir'aun (Pharaoh) said: "Leave me to kill Musa (Moses), and let him call his Lord (to stop me from killing him)! I fear that he may change your religion, or that he may cause mischief to appear in the land!"

source: وقال موسى إني عذت بربي وربكم من كل متكبر لا يؤمن بيوم الحساب
en: Musa (Moses) said: "Verily I seek refuge in my Lord and your Lord from every arrogant who believes not in the Day of Reckoning!"

source: وقال رجل مؤمن من آل فرعون يكتم إيمانه أتقتلون رجلا أن يقول ربي الله وقد جاءكم بالبينات من ربكم وإن يك كاذبا فعليه كذبه وإن يك صادقا يصبكم بعض الذي يعدكم إن الله لا يهدي من هو مسرف كذاب
en: And a believing man of Fir'aun's (Pharaoh) family, who hid his faith said: "Would you kill a man because he says: My Lord is Allah, and he has come to you with clear signs (proofs) from your Lord? And if he is a liar, upon him will be (the sin of) his lie; but if he is telling the truth, then some of that (calamity) wherewith he threatens you will befall on you." Verily, Allah guides not one who is a Musrif (a polytheist, or a murderer who shed blood without a right, or those who commit great sins, oppressor, transgressor), a liar!

source: يا قوم لكم الملك اليوم ظاهرين في الأرض فمن ينصرنا من بأس الله إن جاءنا قال فرعون ما أريكم إلا ما أرى وما أهديكم إلا سبيل الرشاد
en: "O my people! Yours is the kingdom today, you being dominant in the land. But who will save us from the Torment of Allah, should it befall us?" Fir'aun (Pharaoh) said: "I show you only that which I see (correct), and I guide you only to the path of right policy!"

source: وقال الذي آمن يا قوم إني أخاف عليكم مثل يوم الأحزاب
en: And he who believed said: "O my people! Verily, I fear for you a fate like that day (of disaster) of the Confederates (of old)!

source: مثل دأب قوم نوح وعاد وثمود والذين من بعدهم وما الله يريد ظلما للعباد
en: "Like the fate of the people of Nuh (Noah), and 'Ad, and Thamud and those who came after them. And Allah wills no injustice for (His) slaves.

source: ويا قوم إني أخاف عليكم يوم التناد
en: "And, O my people! Verily, I fear for you the Day when there will be mutual calling (between the people of Hell and of Paradise)."

source: يوم تولون مدبرين ما لكم من الله من عاصم ومن يضلل الله فما له من هاد
en: A Day when you will turn your backs and flee having no protector from Allah. And whomsoever Allah sends astray, for him there is no guide.

source: ولقد جاءكم يوسف من قبل بالبينات فما زلتم في شك مما جاءكم به حتى إذا هلك قلتم لن يبعث الله من بعده رسولا كذلك يضل الله من هو مسرف مرتاب
en: And indeed Yusuf (Joseph) did come to you, in times gone by, with clear signs, but you ceased not to doubt in that which he did bring to you: till when he died you said: "No Messenger will Allah send after him." Thus Allah leaves astray him who is a Musrif (a polytheist, an oppressor, a criminal, sinner who commit great sins) and a Murtab (one who doubts Allah's Warning and His Oneness).

source: الذين يجادلون في آيات الله بغير سلطان أتاهم كبر مقتا عند الله وعند الذين آمنوا كذلك يطبع الله على كل قلب متكبر جبار
en: Those who dispute about the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, without any authority that has come to them, it is greatly hateful and disgusting to Allah and to those who believe. Thus does Allah seal up the heart of every arrogant, tyrant. (So they cannot guide themselves to the Right Path).

source: وقال فرعون يا هامان ابن لي صرحا لعلي أبلغ الأسباب
en: And Fir'aun (Pharaoh) said: "O Haman! Build me a tower that I may arrive at the ways -

source: أسباب السماوات فأطلع إلى إله موسى وإني لأظنه كاذبا وكذلك زين لفرعون سوء عمله وصد عن السبيل وما كيد فرعون إلا في تباب
en: "The ways of the heavens, and I may look upon the Ilah (God) of Musa (Moses): But verily, I think him to be a liar." Thus it was made fair-seeming, in Fir'aun's (Pharaoh) eyes, the evil of his deeds, and he was hindered from the (Right) Path; and the plot of Fir'aun (Pharaoh) led to nothing but loss and destruction (for him).

source: وقال الذي آمن يا قوم اتبعون أهدكم سبيل الرشاد
en: And the man who believed said: "O my people! Follow me, I will guide you to the way of right conduct [i.e. guide you to Allah's religion of Islamic Monotheism with which Musa (Moses) has been sent].

source: يا قوم إنما هذه الحياة الدنيا متاع وإن الآخرة هي دار القرار
en: "O my people! Truly, this life of the world is nothing but a (quick passing) enjoyment, and verily, the Hereafter that is the home that will remain forever."

source: من عمل سيئة فلا يجزى إلا مثلها ومن عمل صالحا من ذكر أو أنثى وهو مؤمن فأولئك يدخلون الجنة يرزقون فيها بغير حساب
en: "Whosoever does an evil deed, will not be requited except the like thereof; and whosoever does a righteous deed, whether male or female and is a true believer (in the Oneness of Allah), such will enter Paradise, where they will be provided therein (with all things in abundance) without limit.

source: ويا قوم ما لي أدعوكم إلى النجاة وتدعونني إلى النار
en: "And O my people! How is it that I call you to salvation while you call me to the Fire!

source: تدعونني لأكفر بالله وأشرك به ما ليس لي به علم وأنا أدعوكم إلى العزيز الغفار
en: "You invite me to disbelieve in Allah (and in His Oneness), and to join partners in worship with Him of which I have no knowledge; and I invite you to the All-Mighty, the Oft-Forgiving!

source: لا جرم أنما تدعونني إليه ليس له دعوة في الدنيا ولا في الآخرة وأن مردنا إلى الله وأن المسرفين هم أصحاب النار
en: "No doubt you call me to (worship) one who cannot grant (me) my request (or respond to my invocation) in this world or in the Hereafter. And our return will be to Allah, and Al-Musrifun (i.e. polytheists and arrogants, those who commit great sins, the transgressors of Allah's set limits): they shall be the dwellers of the Fire!

source: فستذكرون ما أقول لكم وأفوض أمري إلى الله إن الله بصير بالعباد
en: "And you will remember what I am telling you, and my affair I leave it to Allah. Verily, Allah is the All-Seer of (His) slaves."

source: فوقاه الله سيئات ما مكروا وحاق بآل فرعون سوء العذاب
en: So Allah saved him from the evils that they plotted (against him), while an evil torment encompassed Fir'aun's (Pharaoh) people.

source: النار يعرضون عليها غدوا وعشيا ويوم تقوم الساعة أدخلوا آل فرعون أشد العذاب
en: The Fire, they are exposed to it, morning and afternoon. And on the Day when the Hour will be established (it will be said to the angels): "Cause Fir'aun's (Pharaoh) people to enter the severest torment!"

source: وإذ يتحاجون في النار فيقول الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا نصيبا من النار
en: And, when they will dispute in the Fire, the weak will say to those who were arrogant: "Verily, we followed you: can you then take from us some portion of the Fire?"

source: قال الذين استكبروا إنا كل فيها إن الله قد حكم بين العباد
en: Those who were arrogant will say: "We are all (together) in this (Fire)! Verily, Allah has judged between (His) slaves!"

source: وقال الذين في النار لخزنة جهنم ادعوا ربكم يخفف عنا يوما من العذاب
en: And those in the Fire will say to the keepers (angels) of Hell: "Call upon your Lord to lighten for us the torment for a day!"

source: قالوا أولم تك تأتيكم رسلكم بالبينات قالوا بلى قالوا فادعوا وما دعاء الكافرين إلا في ضلال
en: They will say: "Did there not come to you, your Messengers with (clear) evidence (and signs)?" They will say: "Yes." They will reply: "Then call (as you like)! And the invocation of the disbelievers is nothing but in vain (as it will not be answered by Allah)!"

source: إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد
en: Verily, We will indeed make victorious Our Messengers and those who believe (in the Oneness of Allah - Islamic Monotheism) in this world's life and on the Day when the witnesses will stand forth, (i.e. Day of Resurrection) -

source: يوم لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار
en: The Day when their excuses will be of no profit to Zalimun (polytheists, wrong-doers and disbelievers in the Oneness of Allah). Theirs will be the curse, and theirs will be the evil abode (i.e. painful torment in Hell-fire).

source: ولقد آتينا موسى الهدى وأورثنا بني إسرائيل الكتاب
en: And, indeed We gave Musa (Moses) the guidance, and We caused the Children of Israel to inherit the Scripture [i.e. the Taurat (Torah)] -

source: هدى وذكرى لأولي الألباب
en: A guide and a reminder for men of understanding.

source: فاصبر إن وعد الله حق واستغفر لذنبك وسبح بحمد ربك بالعشي والإبكار
en: So be patient (O Muhammad صلى الله عليه وسلم). Verily, the Promise of Allah is true, and ask forgiveness for your fault and glorify the praises of your Lord in the 'Ashi (i.e. the time period after the midnoon till sunset) and in the Ibkar (i.e. the time period from early morning or sunrise till before midnoon) [it is said that, that means the five compulsory congregational Salat (prayers) or the 'Asr and Fajr prayers].

source: إن الذين يجادلون في آيات الله بغير سلطان أتاهم إن في صدورهم إلا كبر ما هم ببالغيه فاستعذ بالله إنه هو السميع البصير
en: Verily those who dispute about the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, without any authority having come to them, there is nothing else in their breasts except pride [to accept you (Muhammad صلى الله عليه وسلم) as a Messenger of Allah and to obey you] . They will never have it (i.e. Prophethood which Allah has bestowed upon you). So seek refuge in Allah (O Muhammad صلى الله عليه وسلم from the arrogants). Verily, it is He Who is the All-Hearer, the All-Seer.

source: لخلق السماوات والأرض أكبر من خلق الناس ولكن أكثر الناس لا يعلمون
en: The creation of the heavens and the earth is indeed greater than the creation of mankind; yet, most of mankind know not.

source: وما يستوي الأعمى والبصير والذين آمنوا وعملوا الصالحات ولا المسيء قليلا ما تتذكرون
en: And not equal are the blind and those who see; nor are (equal) those who believe (in the Oneness of Allah - Islamic Monotheism), and do righteous good deeds, and those who do evil. Little do you remember!

source: إن الساعة لآتية لا ريب فيها ولكن أكثر الناس لا يؤمنون
en: Verily, the Hour (Day of Judgement) is surely coming, there is no doubt about it, yet most men believe not.

source: وقال ربكم ادعوني أستجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين
en: And your Lord said: "Invoke Me, [i.e. believe in My Oneness (Islamic Monotheism) and ask Me for anything] I will respond to your (invocation). Verily! Those who scorn My worship [i.e. do not invoke Me, and do not believe in My Oneness, (Islamic Monotheism)] they will surely enter Hell in humiliation!"

source: الله الذي جعل لكم الليل لتسكنوا فيه والنهار مبصرا إن الله لذو فضل على الناس ولكن أكثر الناس لا يشكرون
en: Allah, it is He Who has made the night for you that you may rest therein and the day for you to see. Truly, Allah is full of Bounty to mankind; yet, most of mankind give no thanks.

source: ذلكم الله ربكم خالق كل شيء لا إله إلا هو فأنى تؤفكون
en: That is Allah, your Lord, the Creator of all things: La ilaha illa Huwa (none has the right to be worshipped but He). How then are you turning away (from Allah, by worshipping others instead of Him)?

source: كذلك يؤفك الذين كانوا بآيات الله يجحدون
en: Thus were turned away those who used to deny the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah.

source: الله الذي جعل لكم الأرض قرارا والسماء بناء وصوركم فأحسن صوركم ورزقكم من الطيبات ذلكم الله ربكم فتبارك الله رب العالمين
en: Allah, it is He Who has made for you the earth as a dwelling place and the sky as a canopy, and has given you shape and made your shapes good (looking) and has provided you with good things. That is Allah, your Lord: so Blessed be Allah, the Lord of the 'Alamin (mankind, jinn and all that exists).

source: هو الحي لا إله إلا هو فادعوه مخلصين له الدين الحمد لله رب العالمين
en: He is the Ever Living, La ilaha illa Huwa (none has the right to be worshipped but He); so invoke Him making your worship pure for Him Alone (by worshipping Him Alone, and none else, and by doing righteous deeds sincerely for Allah's sake only, and not to show off, and not setting up rivals with Him in worship). All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinn and all that exists).
